---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussChordUntransformable
source: html/cdfd61d2-1a2f-72e5-b742-fa5909dbdae1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussChordUntransformable Property

Unable to maintain user changes to unpinned Chord. Restoring Truss-defined shape.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussChordUntransformable { get; }
```